---
kind: method
id: M:Autodesk.Revit.UI.EditorInteraction.#ctor
source: html/542f4789-073c-228e-45bf-240d639937c4.htm
---
# Autodesk.Revit.UI.EditorInteraction.#ctor Method

Construct a default interaction.

## Syntax (C#)
```csharp
public EditorInteraction()
```